RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L43x_Firmware_Library/n32l43x_std_periph_driver/src/n32l43x_lprcnt.c
/** ----------------------------------------------------------------------------
 *         Nationz Technology Software Support  -  NATIONZ  -
 * -----------------------------------------------------------------------------
 * Copyright (c) 2022, Nationz Corporation  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaiimer below.
 *
 * - Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the disclaimer below in the documentation and/or
 * other materials provided with the distribution.
 *
 * Nationz's name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONZ "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
 * -----------------------------------------------------------------------------
 */

/** ****************************************************************************
 * @copyright      Nationz Co.,Ltd
 *                 Copyright (c) 2019 All Rights Reserved
 *******************************************************************************
 * @file     n32l43x_LPRCNT.c
 * @author
 * @date
 * @version  v1.2.0
 * @brief
 ******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "n32l43x_LPRCNT.h"
//nclude "n32l43x_rcc.h"
//#include "n32l43x.h"
#include "n32l43x_exti.h"
#include "misc.h"
/** @addtogroup n32l43x_StdPeriph_Driver
  * @{
  */

/** @defgroup LPRCNT
  * @brief LPRCNT driver modules
  * @{
  */

/** @defgroup LPRCNT_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */




/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/**
  * @brief clear LPRCNT interrupt flag funtion.
  * @param  intflag: include LPRCNT interrupt flag
  *   This parameter can be one of the following values:
  *     @arg CALIBRATION_INT_FLAG
  *     @arg REPORT_INT_FLAG
  *     @arg ALARM_INT_FLAG
  * @retval None
  */
void LPRCNT_ClrIntBit(uint32_t IntFlag)
{
    LPRCNT->INTSTS |= IntFlag;
}

/**
 * @brief  Checks whether the specified LPRCNT interrupt has occurred or not.
 * @param LPRCNT_INT specifies the LPRCNT interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg CALIBRATION_INT_FLAG   Calibration mode damped oscillation interrupt.
 *     @arg REPORT_INT_FLAG        Report interrupt.
 *     @arg ALARM_INT_FLAG         Alarm interrupt .
 * @return The new state of LPRCNT_INT (SET or RESET).
 */
INTStatus LPRCNT_GetIntSts(uint32_t Int)
{
    INTStatus bitstatus = RESET;
    uint32_t Temp = 0;

    Temp  = LPRCNT->INTSTS ;
    Temp  &= 0x00070000;
    if (Temp == Int)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;

}
/**
  * @brief LPRCNT interrupt funtion.
  * @param  MODE_IE: include LPRCNT interrupt
  *   This parameter can be one of the following values:
  *     @arg CALIBRATION_INT
  *     @arg REPORT_INT
  *     @arg ALARM_INT
  * @param  NewState: open or disable
  *     @arg DISABLE
  *     @arg ENABLE
  * @retval None
  */
void LPRCNT_IntEn(uint32_t Mode ,FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        LPRCNT->CTRL |= Mode;
    }
    else
    {
        LPRCNT->CTRL &= ~Mode;
    }
}
/**
  * @brief  configure per channel sensor detection time.
  * @param  ch: sensor channel .
  * @param  vibrationtime: comparator processing duration time.
  * @param  dischargetime: discharge duration time.
  * @param  chargetime: power charge duration time.
  * @retval None
  */
void CfgChannelTime(uint8_t Ch,uint8_t VibrationTime ,uint8_t DischargeTime,uint8_t  ChargeTime )
{
    uint32_t Temp = 0;
    switch (Ch)
    {
       case CHANNEL_0 :
            Temp = LPRCNT->CH0CFG1;
            Temp &= CLEAR_TIME_VALE;
            Temp |= (uint32_t)((VibrationTime << 16) | (DischargeTime << 8) | (ChargeTime));
            LPRCNT->CH0CFG1 = Temp;
            break;
       case CHANNEL_1 :
            Temp = LPRCNT->CH1CFG1;
            Temp &= CLEAR_TIME_VALE;
            Temp |= (uint32_t)((VibrationTime << 16) | (DischargeTime << 8) | (ChargeTime));
            LPRCNT->CH1CFG1 = Temp;
            break;
       case CHANNEL_2 :
            Temp = LPRCNT->CH2CFG1;
            Temp &= CLEAR_TIME_VALE;
            Temp |= (uint32_t)((VibrationTime << 16) | (DischargeTime << 8) | (ChargeTime));
            LPRCNT->CH2CFG1 = Temp;
            break;
       default: break ;
    }
}

/**
  * @brief  get the comparator processing duration time.
  * @param  ch: sensor channel .
  * @retval duration time
  */
uint8_t GetVibrationTime(uint8_t Ch)
{
    uint8_t Temp = 0;
    switch (Ch)
    {
        case CHANNEL_0 :
            Temp = (LPRCNT->CH0CFG1 >> 16);
            break;
        case CHANNEL_1 :
            Temp = (LPRCNT->CH1CFG1 >> 16);
            break;
        case CHANNEL_2 :
            Temp = (LPRCNT->CH2CFG1 >> 16);
            break;
    }
    return  Temp;
}
/**
  * @brief  get discharge duration time.
  * @param  ch: sensor channel .
  * @retval discharge duration time
  */
uint8_t GetDischargeTime(uint8_t Ch)
{
    uint8_t Temp = 0;
    switch (Ch)
    {
        case CHANNEL_0 :
            Temp = ((LPRCNT->CH0CFG1 >> 8) & 0x3f);
            break;
        case CHANNEL_1 :
            Temp = ((LPRCNT->CH1CFG1 >> 8) & 0x3f);
            break;
        case CHANNEL_2 :
            Temp = ((LPRCNT->CH2CFG1 >> 8) & 0x3f);
            break;
    }
    return  Temp;
}
/**
  * @brief  get charge duration time.
  * @param  ch: sensor channel .
  * @retval charge duration time
  */
uint8_t GetChargeTime(uint8_t Ch)
{
    uint8_t Temp = 0;
    switch (Ch)
    {
        case CHANNEL_0 :
            Temp = (LPRCNT->CH0CFG1 & 0x3f);
            break;
        case CHANNEL_1 :
            Temp = (LPRCNT->CH1CFG1 & 0x3f);
            break;
        case CHANNEL_2 :
            Temp = (LPRCNT->CH2CFG1 & 0x3f);
            break;
    }
    return  Temp;
}
/**
  * @brief  configure per channel sensor detection threshold.
  * @param  ch: sensor channel .
  * @param  dacreference: DAC reference value for comparator.
  * @retval None
  */
void CfgChannelDacRefVol(uint8_t Ch,uint8_t DacRef)
{
    uint32_t Temp = 0;
    switch (Ch)
    {
        case CHANNEL_0 :
            Temp = LPRCNT->CH0CFG0;
            Temp &= (~LPRCNT_CH0CFG0_DACREF);
            Temp |= (uint32_t)(DacRef <<16);
            LPRCNT->CH0CFG0 = Temp;
            break;
        case CHANNEL_1 :
            Temp = LPRCNT->CH1CFG0;
            Temp &= (~LPRCNT_CH1CFG0_DACREF);
            Temp |= (uint32_t)(DacRef <<16);
            LPRCNT->CH1CFG0 = Temp;
            break;
        case CHANNEL_2 :
            Temp = LPRCNT->CH2CFG0;
            Temp &= (~LPRCNT_CH2CFG0_DACREF);
            Temp |= (uint32_t)(DacRef <<16);
            LPRCNT->CH2CFG0 = Temp;
            break;
        default:
            break ;
    }

